Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПродажиЭкскурсий
	Движения.ПродажиЭкскурсий.Записывать = Истина;
	Для Каждого ТекСтрокаЭкскурсии из Экскурсии Цикл
		Движение = Движения.ПродажиЭкскурсий.Добавить();
		Движение.Период = Дата;
		Движение.СпособОплаты = СпособОплаты;
		Движение.Экскурсия = ТекСтрокаЭкскурсии.Экскурсия;
		Движение.Сумма = Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Бронь") Тогда
		// Заполнение шапки
		Бронь = ДанныеЗаполнения.Ссылка;
		Клиент = ДанныеЗаполнения.Клиент;
		Сумма = ДанныеЗаполнения.ОбщаяСтоимость;
		Для Каждого ТекСтрокаЭкскурсии из ДанныеЗаполнения.Экскурсии Цикл
			НоваяСтрока = Экскурсии.Добавить();
			НоваяСтрока.Экскурсия = ТекСтрокаЭкскурсии.Экскурсия;
			НоваяСтрока.Количество = ТекСтрокаЭкскурсии.Количество;
			НоваяСтрока.Цена = ТекСтрокаЭкскурсии.Цена;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
