
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Остаток = СписокПриАктивизацииСтрокиНаСервере(ДанныеСтроки.Счет);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокПриАктивизацииСтрокиНаСервере(Счет)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КассаОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Касса.Остатки(&Дата, СчетОрганизации = &СчетОрганизации) КАК КассаОстатки";
	
	Запрос.УстановитьПараметр("СчетОрганизации", Счет);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	
КонецФункции

