
&НаКлиенте
Процедура ДобавитьИзФайла(Команда)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл xml";
	Проводник.Фильтр = "xml (*.xml)|*.xml";
	ЧтоНужноДелатьПосле = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(ЧтоНужноДелатьПосле);
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ЧтениеXML(ВыбранныеФайлы[0]);
КонецПроцедуры

&НаСервере
Процедура ЧтениеXML(Файл)
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Файл);
	
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	ИмяТекущегоУзла = "";
	ВыбраннаяВалюта = Справочники.Валюты.ПустаяСсылка();
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "Nominal" Тогда
			ИмяТекущегоУзла = "";
			Продолжить;
		ИначеЕсли ИмяТекущегоУзла = "Record" И ЧтениеXML.ТипУзла = ТипУзлаXMl.Текст Тогда
			ИмяТекущегоУзла = "";
			Продолжить;
		ИначеЕсли ИмяТекущегоУзла = "" И ЧтениеXML.ТипУзла = ТипУзлаXMl.Текст Тогда
			Продолжить;
		ИначеЕсли ИмяТекущегоУзла = "Value" И ЧтениеXML.ТипУзла = ТипУзлаXMl.КонецЭлемента Тогда
			ИмяТекущегоУзла = "";
			Продолжить;
		ИначеЕсли ИмяТекущегоУзла = "Record" И ЧтениеXML.ТипУзла = ТипУзлаXMl.КонецЭлемента Тогда
			ИмяТекущегоУзла = "";
			Продолжить;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXMl.НачалоЭлемента И ЧтениеXML.Имя = "ValCurs" Тогда
			ИмяТекущегоУзла = "ValCurs";
			Пока ЧтениеXML.ПрочитатьАтрибут() И ЧтениеXML.Имя = "ID" Цикл
				//Поиск ссылки на валюту в справочнике Валюты. С этими условиями функция вызывается 1 раз 
				ВыбраннаяВалюта = НайтиВалютуПоНомеру(ЧтениеXML.Значение);
				//Установка отбора по валюте 
				НаборЗаписей.Отбор.Валюта.Установить(ВыбраннаяВалюта);
			КонецЦикла;
			Продолжить;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXMl.НачалоЭлемента И ЧтениеXML.Имя = "Record" Тогда
			ИмяТекущегоУзла = "Record";
			Пока ЧтениеXML.ПрочитатьАтрибут() И ЧтениеXML.Имя = "Date" Цикл
					ДатаМассив = СтрРазделить(ЧтениеXML.Значение, ".");
					КорректнаяДата = "" + ДатаМассив[2] + ДатаМассив[1] + ДатаМассив[0];
					ОписаниеТипа = Новый ОписаниеТипов("Дата"); 
					Результат    = ОписаниеТипа.ПривестиЗначение(КорректнаяДата);
					//создание записи в наборе
					ЗаписьНабора = НаборЗаписей.Добавить();
					ЗаписьНабора.Период = Результат;
			КонецЦикла;
			Продолжить;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXMl.НачалоЭлемента И ЧтениеXML.Имя = "Value" Тогда
			ИмяТекущегоУзла = "Value";
			Продолжить;	
		ИначеЕсли ИмяТекущегоУзла = "Value" И ЧтениеXML.ТипУзла = ТипУзлаXMl.Текст Тогда
			ЗаписьНабора.Валюта = ВыбраннаяВалюта;
			ОписаниеТипа = Новый ОписаниеТипов("Число"); 
			Результат    = ОписаниеТипа.ПривестиЗначение(ЧтениеXML.Значение);
			ЗаписьНабора.Курс = Результат;
			Продолжить;
		ИначеЕсли ЧтениеXML.Имя = "ValCurs" И ЧтениеXML.ТипУзла = ТипУзлаXMl.КонецЭлемента Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиВалютуПоНомеру(НомерВалюты)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.КодВалютыЦБ = &КодВалютыЦБ";
	
	Запрос.УстановитьПараметр("КодВалютыЦБ", НомерВалюты);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Справочники.Валюты.ПустаяСсылка();
	Иначе 
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
КонецФункции;


