#Область ОбработчикиСобытийЭлементовТаблицыФормыЭкскурсии

&НаКлиенте
Процедура ЭкскурсииКоличествоПриИзменении(Элемент)
	ДанныеСтроки = Элементы.Экскурсии.ТекущиеДанные;
	ДанныеСтроки.Цена = ВернутьЦенуЭкскурсии(ДанныеСтроки.Экскурсия)  * ДанныеСтроки.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ЭкскурсииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)  
	Объект.ОбщаяСтоимость = Объект.Экскурсии.Итог("Цена");
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьЦенуЭкскурсии(Элемент)
	
	СтоимостьЭкскурсии = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Экскурсии.Цена КАК Цена
		|ИЗ
		|	Справочник.Экскурсии КАК Экскурсии
		|ГДЕ
		|	Экскурсии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Элемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат СтоимостьЭкскурсии; 
	Иначе 
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		СтоимостьЭкскурсии = ВыборкаДетальныеЗаписи.Цена;	
		Возврат СтоимостьЭкскурсии;
	КонецЕсли;
	
КонецФункции


#КонецОбласти