#Область СлужебныеПроцедурыИФункции
Функция ВернутьВалютуСчета(СсылкаСчет) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетаОрганизации.Валюта
		|ИЗ
		|	Справочник.СчетаОрганизации КАК СчетаОрганизации
		|ГДЕ
		|	СчетаОрганизации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Перечисления.Валюта.ПустаяСсылка()
	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Валюта;
	
КонецФункции

#КонецОбласти